---
kind: property
id: P:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.ParameterOnSecondCurve
source: html/cd32ec9c-5e44-28f1-0034-619a615f9c34.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.ParameterOnSecondCurve Property

1d raw (not normalized) parameter of the point on the second curve.

## Syntax (C#)
```csharp
public double ParameterOnSecondCurve { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The property has not been set by the method providing the result.